package com.javarush.test.level09.lesson11.home05;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;

/* Гласные и согласные буквы
Написать программу, которая вводит с клавиатуры строку текста.
Программа должна вывести на экран две строки:
1. первая строка содержит только гласные буквы
2. вторая - только согласные буквы и знаки препинания из введённой строки.
Буквы соединять пробелом.

Пример ввода:
Мама мыла раму.
Пример вывода:
а а ы а а у
М м м л р м .
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        //Написать тут ваш код
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        String str = reader.readLine();
        char[] list = new char[str.length()];
        list = str.toCharArray();
        ArrayList<Character> consonants = new ArrayList<Character>();
        ArrayList<Character> vowels = new ArrayList<Character>();
        for (int i = 0; i < str.length(); i++){
            if (isVowel(list[i])) vowels.add(list[i]);
            else consonants.add(list[i]);
        }
        for (int i = 0; i < vowels.size(); i++){
            System.out.print(vowels.get(i) + " ");
        }
        System.out.println();
        for (int i = 0; i < consonants.size(); i++){
            System.out.print(consonants.get(i) + " ");
        }
    }


    public static char[] vowels = new char[]{'а', 'я', 'у', 'ю', 'и', 'ы', 'э', 'е', 'о', 'ё'};

    //метод проверяет, гласная ли буква
    public static boolean isVowel(char c)
    {
        c = Character.toLowerCase(c);  //приводим символ в нижний регистр - от заглавных к строчным буквам

        for (char d : vowels)   //ищем среди массива гласных
        {
            if (c == d)
                return true;
        }
        return false;
    }
}
