package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 12 2012".
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
       System.out.print("13 04 2014");
    }
}
